{"1":"Has a 10% chance of making target Pokémon flinch with each hit.","2":"Summons rain that lasts indefinitely upon entering battle.","3":"Raises Speed one stage after each turn.","4":"Protects against critical hits.","5":"Prevents being KOed from full HP, leaving 1 HP instead.  Protects against the one-hit KO moves regardless of HP.","6":"Prevents self destruct, explosion, and aftermath from working while the Pokémon is in battle.","7":"Prevents paralysis.","8":"Increases evasion to 1.25× during a sandstorm.  Protects against sandstorm damage.","9":"Has a 30% chance of paralyzing attacking Pokémon on contact.","10":"Absorbs electric moves, healing for 1/4 max HP.","11":"Absorbs water moves, healing for 1/4 max HP.","12":"Prevents infatuation and protects against captivate.","13":"Negates all effects of weather, but does not prevent the weather itself.","14":"Increases moves' accuracy to 1.3×.","15":"Prevents sleep.","16":"Changes type to match when hit by a damaging move.","17":"Prevents poison.","18":"Protects against fire moves.  Once one has been blocked, the Pokémon's own Fire moves inflict 1.5× damage until it leaves battle.","19":"Protects against incoming moves' extra effects.","20":"Prevents confusion.","21":"Prevents being forced out of battle by other Pokémon's moves.","22":"Lowers opponents' Attack one stage upon entering battle.","23":"Prevents opponents from fleeing or switching out.","24":"Damages attacking Pokémon for 1/8 their max HP on contact.","25":"Protects against damaging moves that are not super effective.","26":"Evades ground moves.","27":"Has a 30% chance of inflcting either paralysis, poison, or sleep on attacking Pokémon on contact.","28":"Copies burns, paralysis, and poison received onto the Pokémon that inflicted them.","29":"Prevents stats from being lowered by other Pokémon.","30":"Cures any major status ailment upon switching out.","31":"Redirects single-target electric moves to this Pokémon where possible.  Absorbs Electric moves, raising Special Attack one stage.","32":"Doubles the chance of moves' extra effects occurring.","33":"Doubles Speed during rain.","34":"Doubles Speed during strong sunlight.","35":"Doubles the wild encounter rate.","36":"Copies an opponent's ability upon entering battle.","37":"Doubles Attack in battle.","38":"Has a 30% chance of poisoning attacking Pokémon on contact.","39":"Prevents flinching.","40":"Prevents freezing.","41":"Prevents burns.","42":"Prevents steel opponents from fleeing or switching out.","43":"Protects against sound-based moves.","44":"Heals for 1/16 max HP after each turn during rain.","45":"Summons a sandstorm that lasts indefinitely upon entering battle.","46":"Increases the PP cost of moves targetting the Pokémon by one.","47":"Halves damage from fire and ice moves.","48":"Makes sleep pass twice as quickly.","49":"Has a 30% chance of burning attacking Pokémon on contact.","50":"Ensures success fleeing from wild battles.","51":"Prevents accuracy from being lowered.","52":"Prevents Attack from being lowered by other Pokémon.","53":"Picks up other Pokémon's used and Flung held items.  May also pick up an item after battle.","54":"Skips every second turn.","55":"Strengthens physical moves to inflict 1.5× damage, but decreases their accuracy to 0.8×.","56":"Has a 30% chance of infatuating attacking Pokémon on contact.","57":"Increases Special Attack to 1.5× when a friendly Pokémon has plus or minus.","58":"Increases Special Attack to 1.5× when a friendly Pokémon has plus or minus.","59":"Changes castform's type and form to match the weather.","60":"Prevents a held item from being removed by other Pokémon.","61":"Has a 33% chance of curing any major status ailment after each turn.","62":"Increases Attack to 1.5× with a major status ailment.","63":"Increases Defense to 1.5× with a major status ailment.","64":"Damages opponents using leeching moves for as much as they would heal.","65":"Strengthens grass moves to inflict 1.5× damage at 1/3 max HP or less.","66":"Strengthens fire moves to inflict 1.5× damage at 1/3 max HP or less.","67":"Strengthens water moves to inflict 1.5× damage at 1/3 max HP or less.","68":"Strengthens bug moves to inflict 1.5× damage at 1/3 max HP or less.","69":"Protects against recoil damage.","70":"Summons strong sunlight that lasts indefinitely upon entering battle.","71":"Prevents opponents from fleeing or switching out.  Eluded by flying-types and Pokémon in the air.","72":"Prevents sleep.","73":"Prevents stats from being lowered by other Pokémon.","74":"Doubles Attack in battle.","75":"Protects against critical hits.","76":"Negates all effects of weather, but does not prevent the weather itself.","77":"Doubles evasion when confused.","78":"Absorbs electric moves, raising Speed one stage.","79":"Increases damage inflicted to 1.25× against Pokémon of the same gender, but decreases damage to 0.75× against the opposite gender.","80":"Raises Speed one stage upon flinching.","81":"Increases evasion to 1.25× during hail.  Protects against hail damage.","82":"Makes the Pokémon eat any held Berry triggered by low HP below 1/2 its max HP.","83":"Raises Attack to the maximum of six stages upon receiving a critical hit.","84":"Doubles Speed upon using or losing a held item.","85":"Halves damage from fire moves and burns.","86":"Doubles the Pokémon's stat modifiers.  These doubled modifiers are still capped at -6 or 6 stages.","87":"Causes 1/8 max HP in damage each turn during strong sunlight, but heals for 1/8 max HP during rain.  Increases damage from fire moves to 1.25×, but absorbs water moves, healing for 1/4 max HP.","88":"Raises the attack stat corresponding to the opponents' weaker defense one stage upon entering battle.","89":"Strengthens punch-based moves to 1.2× their power.","90":"Heals for 1/8 max HP after each turn when poisoned in place of damage.","91":"Increases the same-type attack bonus from 1.5× to 2×.","92":"Extends two-to-five-hit moves and triple kick to their full length every time.","93":"Cures any major status ailment after each turn during rain.","94":"Increases Special Attack to 1.5× but costs 1/8 max HP after each turn during strong sunlight.","95":"Increases Speed to 1.5× with a major status ailment.","96":"Makes the Pokémon's moves all act normal-type.","97":"Strengthens critical hits to inflict 3× damage rather than 2×.","98":"Protects against damage not directly caused by a move.","99":"Ensures all moves used by and against the Pokémon hit.","100":"Makes the Pokémon move last within its move's priority bracket.","101":"Strengthens moves of 60 base power or less to 1.5× their power.","102":"Protects against major status ailments during strong sunlight.","103":"Prevents the Pokémon from using its held item in battle.","104":"Bypasses targets' abilities if they could hinder or prevent a move.","105":"Raises moves' critical hit rates one stage.","106":"Damages the attacker for 1/4 its max HP when knocked out by a contact move.","107":"Notifies all trainers upon entering battle if an opponent has a super-effective move, self destruct, explosion, or a one-hit KO move.","108":"Reveals the opponents' strongest move upon entering battle.","109":"Ignores other Pokémon's stat modifiers for damage and accuracy calculation.","110":"Doubles damage inflicted with not-very-effective moves.","111":"Decreases damage taken from super-effective moves by 1/4.","112":"Halves Attack and Speed for five turns upon entering battle.","113":"Lets the Pokémon's normal and fighting moves hit ghost Pokémon.","114":"Redirects single-target water moves to this Pokémon where possible.  Absorbs Water moves, raising Special Attack one stage.","115":"Heals for 1/16 max HP after each turn during hail.  Protects against hail damage.","116":"Decreases damage taken from super-effective moves by 1/4.","117":"Summons hail that lasts indefinitely upon entering battle.","118":"The Pokémon may pick up honey after battle.","119":"Reveals an opponent's held item upon entering battle.","120":"Strengthens recoil moves to 1.2× their power.","121":"Changes arceus's type and form to match its held Plate.","122":"Increases friendly Pokémon's Attack and Special Defense to 1.5× during strong sunlight.","123":"Damages sleeping opponents for 1/8 their max HP after each turn.","124":"Steals attacking Pokémon's held items on contact.","125":"Strengthens moves with extra effects to 1.3× their power, but prevents their extra effects.","126":"Inverts stat changes.","127":"Prevents opposing Pokémon from eating held Berries.","128":"Raises Attack two stages upon having any stat lowered.","129":"Halves Attack and Special Attack at 50% max HP or less.","130":"Has a 30% chance of Disabling any move that hits the Pokémon.","131":"Has a 30% chance of curing each adjacent ally of any major status ailment after each turn.","132":"Decreases all direct damage taken by friendly Pokémon to 0.75×.","133":"Raises Speed and lowers Defense by one stage each upon being hit by a physical move.","134":"Doubles the Pokémon's weight.","135":"Halves the Pokémon's weight.","136":"Halves damage taken from full HP.","137":"Increases Attack to 1.5× when poisoned.","138":"Increases Special Attack to 1.5× when burned.","139":"Has a 50% chance of restoring a used Berry after each turn if the Pokémon has held no items in the meantime.","140":"Protects against friendly Pokémon's damaging moves.","141":"Raises a random stat two stages and lowers another one stage after each turn.","142":"Protects against damage from weather.","143":"Has a 30% chance of poisoning target Pokémon upon contact.","144":"Heals for 1/3 max HP upon switching out.","145":"Protects against Defense drops.","146":"Doubles Speed during a sandstorm.  Protects against sandstorm damage.","147":"Lowers incoming non-damaging moves' base accuracy to exactly 50%.","148":"Strengthens moves to 1.3× their power when moving last.","149":"Takes the appearance of the last conscious party Pokémon upon being sent out until hit by a damaging move.","150":"Transforms upon entering battle.","151":"Bypasses light screen, reflect, and safeguard.","152":"Changes attacking Pokémon's abilities to Mummy on contact.","153":"Raises Attack one stage upon KOing a Pokémon.","154":"Raises Attack one stage upon taking damage from a dark move.","155":"Raises Speed one stage upon being hit by a dark, ghost, or bug move.","156":"Reflects most non-damaging moves back at their user.","157":"Absorbs grass moves, raising Attack one stage.","158":"Raises non-damaging moves' priority by one stage.","159":"Strengthens rock, ground, and steel moves to 1.3× their power during a sandstorm.  Protects against sandstorm damage.","160":"Damages attacking Pokémon for 1/8 their max HP on contact.","161":"Changes darmanitan's form after each turn depending on its HP: Zen Mode below 50% max HP, and Standard Mode otherwise.","162":"Increases moves' accuracy to 1.1× for friendly Pokémon.","163":"Bypasses targets' abilities if they could hinder or prevent moves.","164":"Bypasses targets' abilities if they could hinder or prevent moves.","165":"Protects allies against moves that affect their mental state.","166":"Protects friendly grass Pokémon from having their stats lowered by other Pokémon.","167":"Restores HP upon eating a Berry, in addition to the Berry's effect.","168":"Changes the bearer's type to match each move it uses.","169":"Halves damage from physical attacks.","170":"Steals the target's held item when the bearer uses a damaging move.","171":"Protects against bullet, ball, and bomb-based moves.","172":"Raises Special Attack by two stages upon having any stat lowered.","173":"Strengthens biting moves to 1.5× their power.","174":"Turns the bearer's normal moves into ice moves and strengthens them to 1.3× their power.","175":"Prevents friendly Pokémon from sleeping.","176":"Changes aegislash to Blade Forme before using a damaging move, or Shield Forme before using kings shield.","177":"Raises flying moves' priority by one stage.","178":"Strengthens aura and pulse moves to 1.5× their power.","179":"Boosts Defense while grassy terrain is in effect.","180":"Passes the bearer's held item to an ally when the ally uses up its item.","181":"Strengthens moves that make contact to 1.33× their power.","182":"Turns the bearer's normal moves into fairy moves and strengthens them to 1.3× their power.","183":"Lowers attacking Pokémon's Speed by one stage on contact.","184":"Turns the bearer's normal moves into flying moves and strengthens them to 1.3× their power.","185":"Lets the bearer hit twice with damaging moves.  The second hit has half power.","186":"Strengthens dark moves to 1.33× their power for all friendly and opposing Pokémon.","187":"Strengthens fairy moves to 1.33× their power for all friendly and opposing Pokémon.","188":"Makes dark aura and fairy aura weaken moves of their respective types.","189":"Creates heavy rain, which has all the properties of Rain Dance, cannot be replaced, and causes damaging Fire moves to fail.","190":"Creates extremely harsh sunlight, which has all the properties of Sunny Day, cannot be replaced, and causes damaging Water moves to fail.","191":"Creates a mysterious air current, which cannot be replaced and causes moves to never be super effective against Flying Pokémon.","192":"Raises this Pokémon's Defense by one stage when it takes damage from a move.","193":"This Pokémon automatically switches out when its HP drops below half.","194":"This Pokémon automatically switches out when its HP drops below half.","195":"Raises this Pokémon's Defense by two stages when it's hit by a Water move.","196":"This Pokémon's moves critical hit against poisoned targets.","197":"Transforms this Minior between Core Form and Meteor Form.  Prevents major status ailments and drowsiness while in Meteor Form.","198":"This Pokémon's moves have double power against Pokémon that switched in this turn.","199":"Halves damage from Fire moves, doubles damage of Water moves, and prevents burns.","200":"This Pokémon's Steel moves have 1.5× power.","201":"Raises this Pokémon's Special Attack by one stage every time its HP drops below half.","202":"During Hail, this Pokémon has double Speed.","203":"This Pokémon's moves do not make contact.","204":"Sound-based moves become Water-type.","205":"This Pokémon's healing moves have their priority increased by 3.","206":"This Pokémon's Normal moves are Electric and have their power increased to 1.2×.","207":"Doubles this Pokémon's Speed on Electric Terrain.","208":"Wishiwashi becomes Schooling Form when its HP is 25% or higher.","209":"Prevents the first instance of battle damage.","210":"Transforms this Pokémon into Ash-Greninja after fainting an opponent.  Water Shuriken's power is 20 and always hits three times.","211":"Transforms 10% or 50% Zygarde into Complete Forme when its HP is below 50%.","212":"This Pokémon can inflict poison on Poison and Steel Pokémon.","213":"This Pokémon always  acts as though it were Asleep.","214":"Opposing Pokémon cannot use priority attacks.","215":"When this Pokémon faints from an opponent's move, that opponent takes damage equal to the HP this Pokémon had remaining.","216":"Whenever another Pokémon uses a dance move, this Pokémon will use the same move immediately afterwards.","217":"Ally Pokémon's moves have their power increased to 1.3×.","218":"Damage from contact moves is halved.  Damage from Fire moves is doubled.","219":"Opposing Pokémon cannot use priority attacks.","220":"This Pokémon's Special Attack rises by one stage every time any Pokémon faints.","221":"When this Pokémon takes regular damage from a contact move, the attacking Pokémon's Speed lowers by one stage.","222":"When an ally faints, this Pokémon gains its Ability.","223":"When an ally faints, this Pokémon gains its Ability.","224":"Raises this Pokémon's highest stat by one stage when it faints another Pokémon.","225":"Changes this Pokémon's type to match its held Memory.","226":"When this Pokémon enters battle, it changes the terrain to Electric Terrain.","227":"When this Pokémon enters battle, it changes the terrain to Psychic Terrain.","228":"When this Pokémon enters battle, it changes the terrain to Misty Terrain.","229":"When this Pokémon enters battle, it changes the terrain to Grassy Terrain.","230":"Other Pokémon cannot lower this Pokémon's stats.","231":"When this Pokémon has full HP, regular damage from moves is halved.","232":"Reduces super-effective damage to 0.75×."}